{
  "format": "layers-model",
  "generatedBy": "keras v3.13.2",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.13.2",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 7],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}}
            }
          },
          {
            "class_name": "Dropout",
            "config": { "name": "dropout", "rate": 0.3 }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}}
            }
          },
          {
            "class_name": "Dropout",
            "config": { "name": "dropout_1", "rate": 0.3 }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}}
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "dense/kernel", "shape": [7, 32], "dtype": "float32" },
        { "name": "dense/bias", "shape": [32], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [32, 16], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [16], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [16, 1], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [1], "dtype": "float32" }
      ]
    }
  ]
}
